import random


def გამოიცანი_რიცხვი():
    print("გამოიცანი რიცხვი 1-დან 20-მდე!")
    საიდუმლო_რიცხვი = random.randint(1, 20)
    მცდელობები = 0

    while True:
        ნავარაუდები = input("შეიყვანე შენი ვარაუდი: ")

        if not ნავარაუდები.isdigit():
            print("გთხოვთ, შეიყვანეთ მხოლოდ რიცხვი!")
            continue

        ნავარაუდები = int(ნავარაუდები)
        მცდელობები += 1

        if ნავარაუდები < საიდუმლო_რიცხვი:
            print("ცოტა მეტი!")
        elif ნავარაუდები > საიდუმლო_რიცხვი:
            print("ცოტა ნაკლები!")
        else:
            print(f"გილოცავთ! თქვენ გამოიცანით რიცხვი {მცდელობები} მცდელობით!")
            break


გამოიცანი_რიცხვი()
