import random

def hangman():
    სიტყვები = ["წიგნი", "ქუჩა", "ტელევიზორი", "ბანკომატი", "სავარცხელი"]
    საიდუმლო_სიტყვა = random.choice(სიტყვები)
    ნაპოვნი_ასოები = ["_"] * len(საიდუმლო_სიტყვა)
    მცდელობები = 6

    print("Hangman თამაში დაწყებულია!")
    print(" ".join(ნაპოვნი_ასოები))

    while მცდელობები > 0:
        ასო = input("შეიყვანეთ ასო: ").lower()

        if ასო in საიდუმლო_სიტყვა:
            print(f"ასო '{ასო}' არის სიტყვაში!")
            for i, ასო_სიტყვაში in enumerate(საიდუმლო_სიტყვა):
                if ასო == ასო_სიტყვაში:
                    ნაპოვნი_ასოები[i] = ასო
        else:
            მცდელობები -= 1
            print(f"ასო '{ასო}' არ არის სიტყვაში. დარჩენილი მცდელობები: {მცდელობები}")

        print(" ".join(ნაპოვნი_ასოები))

        if "_" not in ნაპოვნი_ასოები:
            print(f"გილოცავთ! თქვენ გამოიცანით სიტყვა '{საიდუმლო_სიტყვა}'!")
            break
    else:
        print(f"თქვენ წააგეთ. საიდუმლო სიტყვა იყო '{საიდუმლო_სიტყვა}'.")

hangman()
